# ExternalResourceTypes.BuiltInExternalResourceTypes Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceTypes..::..BuiltInExternalResourceTypes Class
ExternalResourceTypes Class Members See Also
---
A collection of ids of the ExternalResourceTypes provided by Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class BuiltInExternalResourceTypes
```

Visual Basic
---
```text
Public NotInheritable Class BuiltInExternalResourceTypes
```

Visual C++
---
```text
public ref class BuiltInExternalResourceTypes abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExternalResourceTypes..::..BuiltInExternalResourceTypes
# See Also
ExternalResourceTypes..::..BuiltInExternalResourceTypes Members
Autodesk.Revit.DB Namespace